alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_uart.c
/**
  ******************************************************************************
  * @file    rtl8721dhp_usi_uart.c
  * @author
  * @version V1.0.0
  * @date    2017-09-30
  * @brief   This file contains all the functions prototypes for the USI UART firmware
  *             library, including the following functionalities of the Universal Asynchronous 
  *             Receiver/Transmitter (UART) peripheral:
  *           - Initialization
  *           - Clear UART TX/RX FIFO
  *           - Uart Rx Path Control (disable/enable)
  *           - Baud Rate Setting
  *           - Receive/Send Data Interface
  *           - Uart Low Power Rx Initialization
  *           - Uart Low Power Rx Monitor Function Initialization
  *           - Low Power Rx Baud Rate Setting
  *           - Uart IrDA Function Initialization
  *           - Uart Rx Byte Counter Interface
  *           - Interrupts and flags management
  *
  ******************************************************************************
  * @attention
  *
  * This module is a confidential and proprietary property of RealTek and
  * possession or use of this module requires written permission of RealTek.
  *
  * Copyright(c) 2017, Realtek Semiconductor Corporation. All rights reserved.
  ****************************************************************************** 
  */

#include "ameba_soc.h"
#include "rtl8721d_usi_uart.h"

const USI_DevTable USI_DEV_TABLE[1] = {
		{USI0_DEV, GDMA_HANDSHAKE_INTERFACE_USI0_TX, GDMA_HANDSHAKE_INTERFACE_USI0_RX, USI_IRQ}
};

u32 USI_UART_StateTx[1];
u32 USI_UART_StateRx[1];

USI_UARTCFG_TypeDef usi_uart_config[2]=
{
	/* USI0-UART */
	{
		.LOW_POWER_RX_ENABLE = DISABLE, /*Enable low power RX*/
	},	
	/* USI1-UART */
	{
		.LOW_POWER_RX_ENABLE = DISABLE,
	},
};

/**
  * @brief  Deinitializes the USIx peripheral registers to their default reset values in USI UART mode.
  * @param  USIx: where x can be 0.
  * @retval None
  */
void USI_UARTDeInit(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*reset USI all logic*/
	USIx->SW_RESET &=(~USI_SW_RESET_RSTB);
	USIx->SW_RESET |=USI_SW_RESET_RSTB;

	/*disable USI UART*/
	USIx->USI_MODE_CTRL &= (~USI_SERIAL_MODE);

	/*clear all USI UART interrupts*/
	USIx->INTERRUPT_ALL_CLR = USI_INT_ALL_CLEAR;

	/*disable all interrupts*/
	USIx->INTERRUPT_ENABLE = 0x00000000;
}

/**
  * @brief  Fills each USI_UARTInitStruct member with its default value.
  * @param  USI_UARTInitStruct: pointer to an USI_UARTInitTypeDef structure which will be initialized.
  * @retval   None
  */
 void USI_UARTStructInit(USI_UARTInitTypeDef* USI_UARTInitStruct)
{
	/* USI_UARTInitStruct members default value */
	USI_UARTInitStruct->USI_UARTParity         = USI_RUART_PARITY_ENABLE;
	USI_UARTInitStruct->USI_UARTParityType = USI_RUART_ODD_PARITY;
	USI_UARTInitStruct->USI_UARTStickParity = USI_RUART_STICK_PARITY_DISABLE;
	USI_UARTInitStruct->USI_UARTStopBit       = USI_RUART_STOP_BIT_1;
	USI_UARTInitStruct->USI_UARTWordLen        = USI_RUART_WLS_8BITS;
	USI_UARTInitStruct->USI_UARTRxFifoTrigLevel = 1;
	USI_UARTInitStruct->USI_UARTDmaModeCtrl = ENABLE;
	USI_UARTInitStruct->USI_UARTFlowControl   = DISABLE;
	USI_UARTInitStruct->USI_UARTTxFifoTrigLevel = 0x40;
	USI_UARTInitStruct->USI_UARTFlwCtrlRxHoldThd = 0x04;
}

/**
  * @brief    Initializes the USIx peripheral according to the specified
  *              parameters in the USI_UARTInitStruct.
  * @param  USIx: where x can be 0.
  * @param  USI_UARTInitStruct: pointer to a USI_UARTInitTypeDef structure that contains
  *              the configuration information for the specified USART peripheral. 
  * @retval None
  */
 void USI_UARTInit(USI_TypeDef* USIx, USI_UARTInitTypeDef *USI_UARTInitStruct)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
	assert_param(USI_UARTInitStruct->USI_UARTRxFifoTrigLevel <= 0x40);
	assert_param(IS_USI_UART_PARITY_ENABLE(USI_UARTInitStruct->USI_UARTParity));
	assert_param(IS_USI_UART_PARITY_TYPE(USI_UARTInitStruct->USI_UARTParityType));
	assert_param(IS_USI_UART_STICK_PARITY_ENABLE(USI_UARTInitStruct->USI_UARTStickParity));
	assert_param(IS_USI_UART_STOP_BIT(USI_UARTInitStruct->USI_UARTStopBit));	
	assert_param(IS_USI_UART_WLS(USI_UARTInitStruct->USI_UARTWordLen));	
	assert_param(USI_UARTInitStruct->USI_UARTTxFifoTrigLevel <= 0x40);
	assert_param(USI_UARTInitStruct->USI_UARTFlwCtrlRxHoldThd <= 0x40);

	/*reset USI all logic, this step will clear tx/rx fifo*/
	USIx->SW_RESET &=(~USI_SW_RESET_RSTB);
	USIx->SW_RESET |=USI_SW_RESET_RSTB;

	/*clear rx fifo and release rx fifo logic*/
	USIx->SW_RESET &= (~USI_SW_RESET_RXFIFO_RSTB);
	USIx->SW_RESET |= USI_SW_RESET_RXFIFO_RSTB;

	/*clear tx fifo and release tx fifo logic*/
	USIx->SW_RESET &= (~USI_SW_RESET_TXFIFO_RSTB);
	USIx->SW_RESET |= USI_SW_RESET_TXFIFO_RSTB;

	/*disable USI all mode, configure USI with UART mode*/
	USIx->USI_MODE_CTRL &= (~USI_SERIAL_MODE);
	USIx->USI_MODE_CTRL |= USI_SERIAL_UART_MODE;

	/*reset RX path*/
	USIx->SW_RESET &= (~USI_SW_RESET_RX_RSTB);

	/*release TX path*/
	USIx->SW_RESET |= USI_SW_RESET_TX_RSTB;

	/*disable all interrupts*/
	USIx->INTERRUPT_ENABLE = 0x00000000;

	/*clear all USI UART interrupts*/
	USIx->INTERRUPT_ALL_CLR = USI_INT_ALL_CLEAR;

	/*configure RX fifo trigger level*/
	USIx->RX_FIFO_CTRL &= (~USI_RXFIFO_ALMOST_FULL_TH);
	USIx->RX_FIFO_CTRL |= USI_UARTInitStruct->USI_UARTRxFifoTrigLevel;

	/*configure TX fifo trigger level*/
	USIx->TX_FIFO_CTRL &= (~USI_TXFIFO_ALMOST_EMPTY_TH);
	USIx->TX_FIFO_CTRL |= USI_UARTInitStruct->USI_UARTTxFifoTrigLevel;

	/*set auto flow control RTS hold level*/
	USIx->UART_FLOW_CTRL &= (~USI_UART_RX_HOLD_THRD);
	USIx->UART_FLOW_CTRL |= USI_UARTInitStruct->USI_UARTFlwCtrlRxHoldThd<<8;

	/* Configure FlowControl */
	if (USI_UARTInitStruct->USI_UARTFlowControl == ENABLE) {
		USIx->UART_FLOW_CTRL |= (USI_UART_AUTO_FLOW_EN|USI_UART_RX_RTS);
	} else {
		USIx->UART_FLOW_CTRL &= (~(USI_UART_AUTO_FLOW_EN|USI_UART_RX_RTS));
	}

	/*configure word length, stop bit, parity, parity type, stickparity*/
	USIx->UART_CTRL &= (~(USI_UART_WORD_LEN_MD|USI_UART_STOP_BIT_MD|USI_UART_PARITY_ENABLE|USI_UART_PARITY_EVEN|USI_UART_STICK_PARITY_BIT));
	USIx->UART_CTRL |= ((USI_UARTInitStruct->USI_UARTWordLen) |
		(USI_UARTInitStruct->USI_UARTStopBit) |
		(USI_UARTInitStruct->USI_UARTParity) |
		(USI_UARTInitStruct->USI_UARTParityType) |
		(USI_UARTInitStruct->USI_UARTStickParity));

	if(USI_UARTInitStruct->USI_UARTDmaModeCtrl  != ENABLE) {
		/* disable the USI UART TX/RX  DMA */
		USIx->DMA_ENABLE &= ~ (USI_TX_DMA_ENABLE|USI_RX_DMA_ENABLE);
	}
}

/**
  * @brief    get ovsr & ovsr_adj parameters for the given baudrate 
  * @param  USIx: where x can be 0.
  * @param  baudrate: the desired baudrate
  * @param  ovsr: the pointer to ovsr parameter
  * @param  ovsr_adj: the pointer to ovsr_adj parameter 
  * @retval   searching status: 
  *              - 1: found
  *              - 0: not found
  */
 u32 USI_UARTBaudParaGet(u32 baudrate, u32 *ovsr, u32 *ovsr_adj)
{
	USI_UARTBaudParaGetFull(XTAL_ClkGet(), baudrate, ovsr, ovsr_adj);
	return 1;
}

/**
  * @brief    get ovsr & ovsr_adj parameters according to the given baudrate and UART IP clock.
  * @param  USIx: where x can be 0.
  * @param  IPclk: the given UART IP clock, Unit: [ Hz ]
  * @param  baudrate: the desired baudrate, Unit: bps[ bit per second ]
  * @param  ovsr: integer parameter related to the desired baud rate
  * @param  ovsr_adj: fractional parameter related to the desired baud rate
  * @retval  None
  */
void USI_UARTBaudParaGetFull(u32 IPclk, u32 baudrate, u32 *ovsr, u32 *ovsr_adj)
{
	u32 i;
	u32 Remainder;
	u32 TempAdj = 0;
	u32 TempMultly;

	/*obtain the ovsr parameter*/
	*ovsr = IPclk / baudrate;

	/*get the remainder related to the ovsr_adj parameter*/
	Remainder = IPclk % baudrate;

	/*calculate the ovsr_adj parameter*/
	for(i = 0; i < 11; i++){
		TempAdj = TempAdj << 1;
		TempMultly = (Remainder * (12-i));
		TempAdj |= ((TempMultly / baudrate - (TempMultly - Remainder) / baudrate) ? 1 : 0);
	}

	/*obtain the ovsr_adj parameter*/
	*ovsr_adj = TempAdj;
}

/**
  * @brief    Set Uart Baud Rate use baudrate val.
  * @param  USIx: where x can be 0.
  * @param  BaudRate: Baud Rate Val, like 115200 (unit is HZ).
  * @retval  None
  */
void USI_UARTSetBaud(USI_TypeDef* USIx, u32 BaudRate)
{
	u32 Ovsr;
	u32 Ovsr_adj;
	
