alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_uart.c
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
	
	/* get baud rate parameter based on baudrate */
	USI_UARTBaudParaGetFull(XTAL_ClkGet(), BaudRate, &Ovsr, &Ovsr_adj);

	/*confgure TX path baudrate*/
	USIx->UART_TX_FRACTION_BAUD &=(~(USI_UART_TX_XFACTOR|USI_UART_TX_XFACTOR_ADJ));
	USIx->UART_TX_FRACTION_BAUD |= (Ovsr|(Ovsr_adj<<20));

	/*configure RX path baudrate*/
	USIx->UART_RX_BAUD_XTAL &= (~USI_RUART_LPRX_XTAL_CYCNUM_PERBIT);
	USIx->UART_RX_BAUD_XTAL |= Ovsr;
	USIx->UART_RX_FRACTION_BAUD_CTRL &= (~USI_UART_RX_XFACTOR_ADJ);
	USIx->UART_RX_FRACTION_BAUD_CTRL |= Ovsr_adj;
}
                         
/**
  * @brief    Set Uart Baud Rate use baudrate parameter Ovsr & Ovsr_adj.
  * @param  USIx: where x can be 0.
  * @param  Ovsr: Specifies the ovsr parameter related to baud rate.
  *				This parameter is caculated by using uart IP clock and the desired baud rate
  * @param  Ovsr_adj: Specifies the ovsr_adj parameter related fractional part for the desired baud rate.
  *				This parameter is also caculated by using uart IP clock and the desired baud rate
  * @retval  None
  */
 void USI_UARTSetBaudExt(USI_TypeDef* USIx, u32 Ovsr, u32 Ovsr_adj)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*confgure TX path baudrate*/
	USIx->UART_TX_FRACTION_BAUD &=(~(USI_UART_TX_XFACTOR|USI_UART_TX_XFACTOR_ADJ));
	USIx->UART_TX_FRACTION_BAUD |= (Ovsr|(Ovsr_adj<<20));

	/*configure RX path baudrate*/
	USIx->UART_RX_BAUD_XTAL &= (~USI_RUART_LPRX_XTAL_CYCNUM_PERBIT);
	USIx->UART_RX_BAUD_XTAL |= Ovsr;
	USIx->UART_RX_FRACTION_BAUD_CTRL &= (~USI_UART_RX_XFACTOR_ADJ);
	USIx->UART_RX_FRACTION_BAUD_CTRL |= Ovsr_adj;
}

/**
  * @brief    to set the RX FIFO level to trigger RX interrupt/RTS de-assert
  * @param  USIx: where x can be 0.
  * @param  FifoLv: USI UART RX FIFO level, this value can be 1 to 62.
  */	
void USI_UARTSetRxLevel(USI_TypeDef* USIx, u32 FifoLv) 
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*configure RX interrupt trigger level*/
	USIx->RX_FIFO_CTRL &= (~USI_RXFIFO_ALMOST_FULL_TH);
	USIx->RX_FIFO_CTRL |= FifoLv;

	/*configure RX CTS hold level*/
	USIx->UART_FLOW_CTRL &=(~USI_UART_RX_HOLD_THRD);
	USIx->UART_FLOW_CTRL |= (FifoLv<<8);
}

/**
  * @brief    enable or disable USI Uart Rx Path
  * @param  USIx: where x can be 0.
  * @param  NewState: the new state of the Rx Path.
  *              This parameter can be: ENABLE or DISABLE.
  * @note    Because the TX/RX of the IrDA transceiver are in the same module, 
  *              RX fifo can also receive available data when in the process of TX.Therefore,
  *              the RX Path must be disabled when TX is going on.Namely, IrDA must work
  *              in the Half duplex mode, though normal UART IP supports Full duplex.
  * @retval None
  */				
void USI_UARTRxCmd(USI_TypeDef* USIx, u32 NewState)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	if (NewState != DISABLE) {
		/*enable uart receiver*/
		USIx->SW_RESET |= USI_SW_RESET_RX_RSTB;
	} else {
		/*disable uart receiver*/
		USIx->SW_RESET &= (~USI_SW_RESET_RX_RSTB);
	}
}

  /**
  * @brief    check if write data to tx fifo.
  * @param  USIx: where x can be 0.
  * @retval   status value:
  *              - 1: tx fifo is empty and can write data to tx fifo
  *              - 0: tx fifo is not empty  
  */
 u32 USI_UARTWritable(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*check if tx fifo is empty or not. empty return 1 and not empty return 0.*/
	if (USIx->TX_FIFO_STATUS & USI_TXFIFO_EMPTY) {
		return 1;
	}
	else {
		return 0;
	}
}

  /**
  * @brief    check if there is data in rx fifo.
  * @param  USIx: where x can be 0.
  * @retval   status value:
  *              - 1: rx fifo has valid data and can read data from rx fifo
  *              - 0: rx fifo is empty
  */
u32 USI_UARTReadable(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*check if rx fifo has available data. 
	available data return 1 and no available data return 0.*/
	if (!(USIx->RX_FIFO_STATUS & USI_RXFIFO_EMPTY)) {
		return 1;
	}
	else {
		return 0;
	}
}

/**
  * @brief  Transmits single data through the USIx peripheral.
  * @param  USIx: where x can be 0.
  * @param  TxData: the data to transmit.
  * @retval None
  */
 void USI_UARTCharPut(USI_TypeDef* USIx, u8 TxData)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*write one byte to tx fifo*/
	USIx->TX_FIFO_WRITE = TxData;
}

/**
  * @brief  Get the received data by the USIx peripheral.
  * @param  USIx: where x can be 0.
  * @param  pRxByte: the pointer to received data.
  * @retval   None.
  */
void USI_UARTCharGet(USI_TypeDef* USIx, u8  *pRxByte)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*read one byte from rx fifo*/
	*pRxByte = (u8)USIx->RX_FIFO_READ;
}

/**
  * @brief  Receive data from rx FIFO, poll USI_UARTReadable.
  * @param  USIx: selected UART peripheral, where x can be 0.
  * @param[out]  outBuf: buffer to save data read from UART FIFO.
  * @param  count: number of data to be read.
  * @retval none
  */
void USI_UARTReceiveData(
	USI_TypeDef* USIx,
	u8* OutBuf,
	u32 Count
	)
{
	u32 cnt = 0;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
		
	for(cnt = 0; cnt < Count; cnt++) {
		while (USI_UARTReadable(USIx) == 0);

		*OutBuf++ = (u8)USIx->RX_FIFO_READ;
	}
}

/**
  * @brief  Send data to tx FIFO, poll USI_UARTWritable.
  * @param  USIx: selected UART peripheral, where x can be 0.
  * @param  inBuf: buffer to be written to Tx FIFO.
  * @param  count: number of data to be written.
  * @retval none
  */
void USI_UARTSendData(
	USI_TypeDef* USIx,
	u8* InBuf,
	u32 Count
	)
{
	u32 cnt = 0;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
	
	for(cnt = 0; cnt < Count; cnt++) {
		while (USI_UARTWritable(USIx) == 0);
		
		USIx->TX_FIFO_WRITE = *InBuf++;
	}
}

/**
  * @brief  Receive data from rx FIFO, with timeout.
  * @param  USIx: selected UART peripheral, where x can be 0.
  * @param[out]  outBuf: buffer to save data read from UART FIFO.
  * @param  count: number of data to be read.
  * @param  Times: poll USI_UARTReadable times before timeout.
  * @retval transfer len
  */
u32 USI_UARTReceiveDataTO(
	USI_TypeDef* USIx,
	u8* OutBuf,
	u32 Count,
	u32 Times
	)
{
	u32 cnt = 0;
	u32 polltimes = 0;

