alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_uart.c
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	while (1) {
		if (USI_UARTReadable(USIx)) {
			*(OutBuf + cnt) = (u8)USIx->RX_FIFO_READ;
			cnt++;
			polltimes = 0;

			if (cnt >= Count) {
				break;
			}
		} else {
			polltimes++;

			/* time out */
			if (polltimes > Times) {
				break;
			}
		}
	}

	return (cnt);
}

/**
  * @brief  Send data to tx FIFO, with timeout.
  * @param  USIx: selected UART peripheral, where x can be 0.
  * @param  InBuf: buffer to be written to Tx FIFO.
  * @param  Count: number of data to be written.
  * @param  Times: poll USI_UARTWritable times before timeout.
  * @retval transfer len
  */
u32 USI_UARTSendDataTO(
	USI_TypeDef* USIx,
	u8* InBuf,
	u32 Count,
	u32 Times
	)
{
	u32 cnt = 0;
	u32 polltimes = 0;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	while (1) {
		if (USI_UARTWritable(USIx)) {
			USIx->TX_FIFO_WRITE = *(InBuf + cnt);
			cnt++;
			polltimes = 0;

			if (cnt >= Count) {
				break;
			}
		} else {
			polltimes++;

			/* time out */
			if (polltimes > Times) {
				break;
			}
		}
	}

	return (cnt);
}

  /**
  * @brief    Clear Rx Byte Counter.
  * @param  USIx: where x can be 0.
  * @retval   None
  */
void USI_UARTRxByteCntClear(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*write 1 to clear*/
	USIx->RX_FIFO_RD_CNT |= USI_RX_FIFO_RD_CNT_CLR;
}

/**
  * @brief    Get the Rx Byte Counter Value.
  * @param  USIx: where x can be 0.
  * @note    Get the Rx Byte Counter Value
  * @note    this counter will increase 1 for each reading the rx fifo, no matter rx fifo is empty or not.
  * @retval   the value of Rx Byte Counter
  */
u32 USI_UARTRxByteCntGet(USI_TypeDef* USIx)
{
	u32 RegValue;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*Read the REG_RX_BYTE_CNT register value*/
	RegValue = USIx->RX_FIFO_RD_CNT;

	/*Get the rx byte counter field (REG_RX_BYTE_CNT[15:0]) value*/
	RegValue &= USI_RX_FIFO_RD_CNT;

	return RegValue;
}

  /**
  * @brief    enable or disable UART break contol function .
  * @param  USIx: where x can be 0.
  * @param  NewState: This parameter can be: ENABLE or DISABLE.
  * @retval   None
  */
void USI_UARTBreakCtl(USI_TypeDef* USIx, u32 NewState)
{
	u32 RegValue;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*get the Line Control Register(LCR) value*/
	RegValue = USIx->UART_CTRL;

	if(NewState == ENABLE)
		/*enable break control*/
		RegValue |= USI_UART_BREAK_CTRL;
	else
		/*disable break control*/
		RegValue &= (~ USI_UART_BREAK_CTRL);

	USIx->UART_CTRL = RegValue;
}

/**
  * @brief    Clear Rx fifo
  * @param  USIx: where x can be 0.
  * @retval   None
  */
u32 USI_UARTClearRxFifo(USI_TypeDef* USIx)
{
	u32  Temp;
	u32  WaitTime = 5;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*write 0 to clear rx fifo*/
	USIx->SW_RESET &= (~USI_SW_RESET_RXFIFO_RSTB);

	while(WaitTime > 0) {
		/*check Rx fifo if empty or not*/
		Temp = USIx->RX_FIFO_STATUS & USI_RXFIFO_EMPTY;
		if (Temp != 0)
			break;

		WaitTime--;
	}

	USIx->SW_RESET |= USI_SW_RESET_RXFIFO_RSTB;

	if (Temp != 0)
		return _TRUE;
	else
		return _FALSE;
}


/**
  * @brief    Clear Tx fifo .
  * @param  USIx: where x can be 0.
  * @retval   None
  */
void USI_UARTClearTxFifo(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*clear tx fifo*/
	USIx->SW_RESET &= (~USI_SW_RESET_TXFIFO_RSTB);
	USIx->SW_RESET |= USI_SW_RESET_TXFIFO_RSTB;	
}

/**
  * @brief    USI UART get valid entry count in RX FIFO .
  * @param  USIx: where x can be 0.
  * @retval   None
  */
u32 USI_UARTGetRxFifoValidCnt(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*acquire RX FIFO valid count*/
	return (u32)((USIx->RX_FIFO_STATUS & USI_RXFIFO_VALID_CNT)>>8);
}

/**
  * @brief    USI UART get empty entry count in TX FIFO .
  * @param  USIx: where x can be 0.
  * @retval   None
  */
u32 USI_UARTGetTxFifoEmptyCnt(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*acquire TX FIFO empty count*/
	return (u32)((USIx->TX_FIFO_STATUS & USI_TXFIFO_EMPTY_SPACE)>>8);
}

/**
  * @brief    Enables or disables the specified USIx UART interrupts.
  * @param  USIx: where x can be 0.
  * @param  USI_UARTIT: specifies the USIx interrupt sources to be enabled or disabled.
  *          This parameter can be one or combinations of the following values:
  *            @arg USI_TX_FIFO_ALMOST_EMPTY_INTER:  tx fifo almost empty interrupt
  *            @arg USI_TX_FIFO_OVERFLOW_INTER: tx fifo overflow interrupt
  *            @arg USI_RX_FIFO_ALMOST_FULL_INTER:   rx fifo almost full interrupt
  *            @arg USI_RX_FIFO_OVERFLOW_INTER: rx fifo overflow interrupt
  *            @arg USI_RX_FIFO_UNDERFLOW_INTER: rx fifo underflow interrupt
  *            @arg USI_UART_PARITY_ERROR_INTER:  uart parity error interrupt
  *            @arg USI_UART_STOP_ERROR_INTER: uart stop bit error interrupt
  *            @arg USI_UART_BREAK_INTER:  uart break interrupt
  *            @arg USI_RX_FIFO_TIMEOUT_INTER:   rx fifo timeout interrupt
  *            @arg USI_RX_BAUDMON_DONE_INTER: uart baud rate monitor done interrupt
  *            @arg USI_TX_CTS_CHANGE_INTER: uart CTS change interrupt
  * @param  newState: new state of the specified USIx interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void USI_UARTINTConfig(
        USI_TypeDef* USIx,
        u32 USI_UARTIT,
        u32 newState
        )
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
	assert_param(IS_USI_UART_IT(USI_UARTIT));

	if (newState == ENABLE) {
		/* Enable the selected USIx interrupts */
		USIx->INTERRUPT_ENABLE |= USI_UARTIT;
	} else {
		/* Disable the selected USIx interrupts */
		USIx->INTERRUPT_ENABLE &= (u32)~USI_UARTIT;
	}
}

/**
  * @brief    get the interrupt identification register value.
  * @param  USIx: where x can be 0.
  * @retval   the interrupt identification register value.
  */
u32 USI_UARTIntStatus(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*return the uart interrupt identification register value*/
	return USIx->INTERRUPT_STATUS;
}

/**
  * @brief    get the raw interrupt register value.
  * @param  USIx: where x can be 0.
  * @retval   the interrupt raw status value.
  */
u32 USI_UARTGetRawIntStatus(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*return the uart interrupt raw status register value*/
	return USIx->RAW_INTERRUPT_STATUS;
}

/**
  * @brief    Clear all USI UART interrupt status.
  * @param  USIx: where x can be 0.
  * @note    Write "1" to this register to clear the combined interrupt, all individual interrupts, 
  *               interrupt status register and raw interrupt status register. This bit does not clear 
  *               hardware clearable interrupts but software dis-clearable interrupts, and the relate register
  *               (include txfifo_almost_empty, rxfifo_almost_full, uart_rxfifo_timeout).
  * @retval   None
  */
void USI_UARTClearAllIntStatus(USI_TypeDef* USIx)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/*write 1 to clear all interrupts*/
	USIx->INTERRUPT_ALL_CLR = USI_INT_ALL_CLEAR;
}

/**
  * @brief    Clear specified USI UART interrupt pending bits.
  * @param  USIx: where x can be 0.
  * @param  USIUART_IT: specifies the interrupt to be cleared.
  *   This parameter can be any combination of the following values:
  *            @arg USI_TX_FIFO_OVERFLOW_INTER: tx fifo overflow interrupt
  *            @arg USI_RX_FIFO_OVERFLOW_INTER: rx fifo overflow interrupt
  *            @arg USI_RX_FIFO_UNDERFLOW_INTER: rx fifo underflow interrupt
  *            @arg USI_UART_PARITY_ERROR_INTER:  uart parity error interrupt
  *            @arg USI_UART_STOP_ERROR_INTER: uart stop bit error interrupt
  *            @arg USI_UART_BREAK_INTER:  uart break interrupt
  *            @arg USI_RX_BAUDMON_DONE_INTER: uart baud rate monitor done interrupt
  *            @arg USI_TX_CTS_CHANGE_INTER: uart CTS change interrupt
  * @retval   None
  */
void USI_UARTClearIntStatus(USI_TypeDef* USIx, u32 USIUART_IT)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
	assert_param(IS_USI_UART_CLEAR_IT(USIUART_IT));
	
	/*write 1 to clear all interrupts*/
	USIx->INTERRUPT_STATUS_CLR =  USIUART_IT;
}

/**
  * @brief  wait uart tx complete.
  * @param  USIx: where x can be 0.
  * @retval: none
  */
void USI_UARTWaitBusy(USI_TypeDef* USIx, u32 PollTimes)
{
	u32 times = 0;

