alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_uart.c
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
	
	/* Wait for Uart print out */
	while(1) {		
		if (USIx->TX_FIFO_STATUS & USI_TXFIFO_EMPTY){
			break;
		}

		DelayUs(100);

		times++;

		if (times > PollTimes)
			break;
	}
}

/**
  * @brief    USI-UART RX timeout configuration .
  * @param  USIx: where x can be 0.
  * @param  TimeOutCnt: timeout counter, unit: bit period.
  * @retval   None
  */
void USI_UARTRxTimeOutConfig(USI_TypeDef* USIx, u32 TimeOutCnt)
{
	u32 TempReg;

	/* Set rx timeout threshold.*/
	TempReg = USIx->UART_RXFIFO_TO_TH;
	TempReg &= ~(USI_UART_RXFIFO_TO_TH);
	TempReg |= TimeOutCnt;

	USIx->UART_RXFIFO_TO_TH = TempReg;
}

 /**
  * @brief    USI UART RX DMA flow control mode configuration .
  * @param  USIx: where x can be 0
  * @param  Mode: DMA flow control mode.
  			This parameter can be: USI_UART_RX_UART_IS_DMA_FLOW_CTRL or USI_UART_RX_GDMA_IS_DMA_FLOW_CTRL.
  * @retval   None
  */
void USI_UARTRxDMAModeConfig(USI_TypeDef* USIx, u32 Mode)
{
	u32 TempReg;

	assert_param(IS_USI_UART_RX_DMA_MODE(Mode));

	/* Set USI UART RX DMA flow control mode.*/
	TempReg = USIx->UART_RXDMA_FLOW_CTRL;
	TempReg &= ~(USI_UART_RXDMA_RXDMA_OWNER);
	TempReg |= Mode;

	USIx->UART_RXDMA_FLOW_CTRL = TempReg;
}

 /**
  * @brief    USI UART RX DMA dummy data configuration .
  * @param  USIx: where x can be 0~1.
  * @param  Byte: dummy data.
  * @retval   None
  */
void USI_UARTRxDMADummyDataConfig(USI_TypeDef* USIx, u8 Byte)
{
	u32 TempReg;

	/* Set UART RX DMA flow control mode.*/
	TempReg = USIx->UART_RXDMA_FLOW_CTRL;
	TempReg &= ~(USI_UART_RXDMA_DUMMY_DATA);
	TempReg |= (Byte<<8);

	USIx->UART_RXDMA_FLOW_CTRL = TempReg;
}

 /**
  * @brief    Get USI UART RX DMA dummy flag .
  * @param  USIx: where x can be 0.
  * @retval   status value:
		    - 0: master not read dummy data from rx fifo
		    - 1: master read dummy data from rx fifo
  */
u32 USI_UARTGetRxDMADummyFlag(USI_TypeDef* USIx)
{
	if(USIx->UART_RXDMA_FLOW_CTRL & USI_UART_RXDMA_DUMMY_FLAG) {
		return 1;
	} else {
		return 0;
	}
}

 /**
  * @brief    Clear USI UART RX DMA dummy flag .
  * @param  USIx: where x can be 0.
  * @retval   None
  */
void USI_UARTRxClearDMADummyFlag(USI_TypeDef* USIx)
{
	USIx->UART_RXDMA_FLOW_CTRL |= USI_UART_RXDMA_DUMMY_FLAG;
}

  /**
  * @brief    configure USI UART TX DMA burst size .
  * @param  USIx: where x can be 0.
  * @param  TxDmaBurstSize: UART TX DMA burst size.
  * @note     Because UART tx fifo depth is 64 in hardware. 
  *              Therefore this value must be no more than 64.
  * @retval   None
  */
void USI_UARTTXDMAConfig(USI_TypeDef* USIx, u32 TxDmaBurstSize)
{
	u32 Temp;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/* Set UART TX DMA burst size.*/
	Temp = USIx->DMA_REQ_SIZE;
	Temp &= ~(USI_TX_DMA_BURST_SIZE|USI_TX_DMA_SINGLE_SIZE);
	Temp |= (TxDmaBurstSize|(1<<8));

	USIx->DMA_REQ_SIZE = Temp;
}

  /**
  * @brief    configure UART RX DMA burst size .
  * @param  USIx: where x can be 0.
  * @param  RxDmaBurstSize: UART RX DMA burst size.
  * @note     Because UART rx fifo depth is 64 in hardare. 
  *              Therefore this value must be no more than 64.
  * @retval   None
  */
void USI_UARTRXDMAConfig(USI_TypeDef* USIx, u32 RxDmaBurstSize)
{
	u32 Temp;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	/* Set UART RX DMA burst size.*/
	Temp = USIx->DMA_REQ_SIZE;
	Temp &= ~(USI_RX_DMA_BURST_SIZE|USI_RX_DMA_BURST_SIZE);
	Temp |= ((RxDmaBurstSize<<16)|(1<<24));

	USIx->DMA_REQ_SIZE = Temp;
}

  /**
  * @brief    enable or disable USI UART TX DMA .
  * @param  USIx: where x can be 0.
  * @param  NewState: the new state of UART TX DMA.
  *               This parameter can be: ENABLE or DISABLE.
  * @retval   None
  */
void USI_UARTTXDMACmd(USI_TypeDef* USIx, u32 NewState)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	if(NewState != DISABLE ){
		/* enable the UART TX DMA */
		USIx->DMA_ENABLE |= USI_TX_DMA_ENABLE;
	} else {
		/* disable the UART TX DMA */
		USIx->DMA_ENABLE &= (~ USI_TX_DMA_ENABLE);
	}
}

  /**
  * @brief    enable or disable USI UART RX DMA .
  * @param  USIx: where x can be 0.
  * @param  NewState: the new state of UART RX DMA.
  *              This parameter can be: ENABLE or DISABLE.
  * @retval   None
  */
void USI_UARTRXDMACmd(USI_TypeDef* USIx, u32 NewState)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	if(NewState != DISABLE ){
		/* enable the UART RX DMA */
		USIx->DMA_ENABLE |= USI_RX_DMA_ENABLE;
	} else {
		/* disable the UART RX DMA */
		USIx->DMA_ENABLE &= (~ USI_RX_DMA_ENABLE);
	}
}

/**
  * @brief    Init and Enable USI UART TX GDMA.
  * @param  USIIndex: 0.
  * @param  GDMA_InitStruct: pointer to a GDMA_InitTypeDef structure that contains 
  *         the configuration information for the GDMA peripheral.
  * @param  CallbackData: GDMA callback data.
  * @param  CallbackFunc: GDMA callback function.
  * @param  pTxBuf: Tx Buffer.
  * @param  TxCount: Tx Count.
  * @retval   TRUE/FLASE
  */
BOOL USI_UARTTXGDMA_Init(
	u8 USIIndex,
	GDMA_InitTypeDef *GDMA_InitStruct,
	void *CallbackData,
	IRQ_FUN CallbackFunc,
	u8 *pTxBuf,
	int TxCount
	)
{
	u8 GdmaChnl;
	
	assert_param(GDMA_InitStruct != NULL);
	
	GdmaChnl = GDMA_ChnlAlloc(0, (IRQ_FUN)CallbackFunc, (u32)CallbackData, 12);//ACUT is 0x10, BCUT is 12
	if (GdmaChnl == 0xFF) {
		/*  No Available DMA channel */
		return _FALSE;
	}	

	_memset((void *)GDMA_InitStruct, 0, sizeof(GDMA_InitTypeDef));
	
	GDMA_InitStruct->MuliBlockCunt     = 0;
	GDMA_InitStruct->MaxMuliBlock      = 1;
	
	GDMA_InitStruct->GDMA_DIR      = TTFCMemToPeri;
	GDMA_InitStruct->GDMA_DstHandshakeInterface   = USI_DEV_TABLE[USIIndex].Tx_HandshakeInterface;
	GDMA_InitStruct->GDMA_DstAddr = (u32)&USI_DEV_TABLE[USIIndex].USIx->TX_FIFO_WRITE;
	GDMA_InitStruct->GDMA_Index   = 0;
	GDMA_InitStruct->GDMA_ChNum       = GdmaChnl;
	GDMA_InitStruct->GDMA_IsrType = (BlockType|TransferType|ErrType);

	GDMA_InitStruct->GDMA_DstMsize  = MsizeFour;
	GDMA_InitStruct->GDMA_DstDataWidth = TrWidthOneByte;
	GDMA_InitStruct->GDMA_DstInc = NoChange;
	GDMA_InitStruct->GDMA_SrcInc = IncType;

	if (((TxCount & 0x03)==0) && (((u32)(pTxBuf) & 0x03)==0)) {
		/* 4-bytes aligned, move 4 bytes each transfer */
		GDMA_InitStruct->GDMA_SrcMsize   = MsizeOne;
		GDMA_InitStruct->GDMA_SrcDataWidth = TrWidthFourBytes;
		GDMA_InitStruct->GDMA_BlockSize = TxCount >> 2;
	} else {
		/* move 1 byte each transfer */
		GDMA_InitStruct->GDMA_SrcMsize   = MsizeFour;
		GDMA_InitStruct->GDMA_SrcDataWidth = TrWidthOneByte;
		GDMA_InitStruct->GDMA_BlockSize = TxCount;
	}

	assert_param(GDMA_InitStruct->GDMA_BlockSize < 4096);
	
	GDMA_InitStruct->GDMA_SrcAddr = (u32)(pTxBuf);

	GDMA_Init(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, GDMA_InitStruct);
	GDMA_Cmd(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, ENABLE);
	
	return _TRUE;
}

/**
  * @brief    Init and Enable UART RX GDMA.
  * @param  USIIndex: 0.
  * @param  GDMA_InitStruct: pointer to a GDMA_InitTypeDef structure that contains 
  *         the configuration information for the GDMA peripheral.
  * @param  CallbackData: GDMA callback data.
  * @param  CallbackFunc: GDMA callback function.
  * @param  pRxBuf: Rx Buffer.
  * @param  RxCount: Rx Count.
  * @retval   TRUE/FLASE
  */
BOOL USI_UARTRXGDMA_Init(
	u8 USIIndex,
	GDMA_InitTypeDef *GDMA_InitStruct,
	void *CallbackData,
	IRQ_FUN CallbackFunc,
	u8 *pRxBuf,
	int RxCount
	)
{
	u8 GdmaChnl;
	
