alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_uart.c
	assert_param(GDMA_InitStruct != NULL);
	
	GdmaChnl = GDMA_ChnlAlloc(0, (IRQ_FUN)CallbackFunc, (u32)CallbackData, 12);//ACUT is 0x10, BCUT is 12
	if (GdmaChnl == 0xFF) {
		/* No Available DMA channel */
		return _FALSE;
	}

	_memset((void *)GDMA_InitStruct, 0, sizeof(GDMA_InitTypeDef));

	GDMA_InitStruct->GDMA_DIR      = TTFCPeriToMem;
	GDMA_InitStruct->GDMA_ReloadSrc = 1;
	GDMA_InitStruct->GDMA_SrcHandshakeInterface = USI_DEV_TABLE[USIIndex].Rx_HandshakeInterface;
	GDMA_InitStruct->GDMA_SrcAddr = (u32)&USI_DEV_TABLE[USIIndex].USIx->RX_FIFO_READ;
	GDMA_InitStruct->GDMA_Index   = 0;
	GDMA_InitStruct->GDMA_ChNum       = GdmaChnl;
	GDMA_InitStruct->GDMA_IsrType = (BlockType|TransferType|ErrType);
	GDMA_InitStruct->GDMA_SrcMsize   = MsizeFour;
	GDMA_InitStruct->GDMA_SrcDataWidth = TrWidthOneByte;
	GDMA_InitStruct->GDMA_DstInc = IncType;
	GDMA_InitStruct->GDMA_SrcInc = NoChange;

	if (((u32)(pRxBuf) & 0x03)==0) {
		/*  4-bytes aligned, move 4 bytes each DMA transaction */
		GDMA_InitStruct->GDMA_DstMsize   = MsizeOne;
		GDMA_InitStruct->GDMA_DstDataWidth = TrWidthFourBytes;
	} else {
		/*  move 1 byte each DMA transaction */
		GDMA_InitStruct->GDMA_DstMsize   = MsizeFour;
		GDMA_InitStruct->GDMA_DstDataWidth = TrWidthOneByte;
	}
	GDMA_InitStruct->GDMA_BlockSize = RxCount;
	GDMA_InitStruct->GDMA_DstAddr = (u32)(pRxBuf);

	assert_param(GDMA_InitStruct->GDMA_BlockSize < 4096);
	
	/* multi block close */
	GDMA_InitStruct->MuliBlockCunt     = 0;
	GDMA_InitStruct->GDMA_ReloadSrc = 0;
	GDMA_InitStruct->MaxMuliBlock = 1;

	GDMA_Init(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, GDMA_InitStruct);
	GDMA_Cmd(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, ENABLE);
	
	return _TRUE;
}

/**
  * @brief  Fills USI_LPUARTInitStruct member low power rx path related with its default value.
  * @param  USI_LPUARTInitStruct: pointer to an USI_LPUARTInitTypeDef structure which will be initialized.
  * @retval None
  */
void USI_UARTLPRxStructInit(USI_LPUARTInitTypeDef* USI_LPUARTInitStruct)
{
	/* USI_LPUARTInitStruct members default value */
	USI_LPUARTInitStruct->USI_LPUARTBitNumThres  = 100;
	USI_LPUARTInitStruct->USI_LPUARTOscPerbitUpdCtrl = ENABLE;
}

/**
  * @brief    Initializes the the UART Low Power RX path peripheral according to the specified
  *              parameters in the USI_LPUARTInitStruct.
  * @param  USIx: where x can be 0.
  * @param  USI_LPUARTInitStruct: pointer to an USI_LPUARTInitTypeDef structure which has been configured.
  * @note    Initial UART Low Power Rx path  steps:
  *              - step1:  Reset Low Power Rx Path.
  *              - step2:  Configure bit number threshold of one monitor period.
  *              - step3:  Configure the update OSC cycnum_perbit bit.
  * @retval   None
  */
void USI_UARTLPRxInit(USI_TypeDef* USIx, USI_LPUARTInitTypeDef *USI_LPUARTInitStruct)
{
	u32 RegValue = 0;

	/*check the parameters*/
	assert_param(IS_ALL_USI_LP_PERIPH(USIx));
	assert_param((USI_LPUARTInitStruct->USI_LPUARTBitNumThres>0) && (USI_LPUARTInitStruct->USI_LPUARTBitNumThres<128));
	
	/* Step 1: Reset Low Power Rx Path */
	USIx->SW_RESET &= (~USI_SW_RESET_RX_RSTB);

	RegValue = USIx->UART_BAUD_MON_CTRL;

	/*step 2: Configure bit number threshold of one monitor period.*/
	RegValue &= (~ USI_UART_LP_RX_BIT_NUM_THRES);
	RegValue |= (USI_LPUARTInitStruct->USI_LPUARTBitNumThres << 8);

	/*step 3: Configure the OSC cycnum_perbit update bit*/	
	if(USI_LPUARTInitStruct->USI_LPUARTOscPerbitUpdCtrl != DISABLE){
		/*enable OSC cycnum_perbit update*/
		RegValue |= USI_UART_LP_RX_OSC_UPD_IN_XTAL;
	} else {
		/*disable OSC cycnum_perbit update*/
		RegValue &= ~ USI_UART_LP_RX_OSC_UPD_IN_XTAL;
	}
	USIx->UART_BAUD_MON_CTRL = RegValue;
}

/**
  * @brief    set uart baud rate of low power rx path
  * @param  USIx: where x can be 0.
  * @param  BaudRate: the desired baud rate
  * @param  RxIPClockHz: the uart rx clock. unit: [Hz]
  * @note    according to the baud rate calculation formlula in low power rx path, method 
  *              implemented is as follows:
  *                                 - CycPerbit = round( fpclock/BaudRate)
  * @retval  None
  */
void USI_UARTLPRxBaudSet(USI_TypeDef* USIx, u32 BaudRate, u32 RxIPClockHz)
{
	u32 CycPerbit = 0;
	u32 RegValue = 0;
	u32 RegOscBaud = 0;

	/*check the parameters*/
	assert_param(IS_ALL_USI_LP_PERIPH(USIx));
	assert_param((BaudRate > 0 && BaudRate <= 500000));

	/*Calculate the r_cycnum_perbit field, 
	   according to clock and the desired baud rate*/
	if((RxIPClockHz % BaudRate) >= (BaudRate + 1) / 2){
		CycPerbit = RxIPClockHz / BaudRate + 1;
	} else {
		CycPerbit = RxIPClockHz / BaudRate;
	}

	/* Average clock cycle number of XTAL clock. */
	RegValue = USIx->UART_RX_BAUD_XTAL;
	
	RegValue &= (~ USI_RUART_LPRX_XTAL_CYCNUM_PERBIT);
	RegValue |= CycPerbit;

	/* set XTAL CycPerbit */
	USIx->UART_RX_BAUD_OSC= RegValue;

	/* Average clock cycle number of one bit OSC. */
	RegOscBaud = USIx->UART_RX_BAUD_OSC;
	RegOscBaud &= (~ USI_UART_LPRX_OSC_CYCNUM_PERBIT);
	RegOscBaud |= CycPerbit;

	/*set the OSC CycPerbit*/
	USIx->UART_RX_BAUD_OSC = RegOscBaud;

	/*set uart_rxbaud_adj = 0*/
	USIx->UART_RX_FRACTION_BAUD_CTRL &= (~USI_UART_RX_XFACTOR_ADJ);
}

/**
  * @brief    enable or disable the monitor function in Low Power Rx Path.
  * @param  USIx: where x can be 0.
  * @param  NewState: the new state of monitoring.
  *              This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void USI_UARTLPRxMonitorCmd(USI_TypeDef* USIx, u32 NewState)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_LP_PERIPH(USIx));
	
	/* configure Low Power rx monitoring function*/
	if(NewState != DISABLE ){
		/* Function enable of monitoring rx baud */
		USIx->UART_BAUD_MON_CTRL |= USI_UART_LP_RX_MON_ENABLE;
	} else {
		/* Function disable of monitoring rx baud */
		USIx->UART_BAUD_MON_CTRL &= (~ USI_UART_LP_RX_MON_ENABLE);
	}
}

/**
  * @brief    select uart rx path.
  * @param  USIx: where x can be 0.
  * @param  LPRxpath: the new state of uart rx path.
  *              This parameter can be: ENABLE or DISABLE.
  *              DISABLE is high rate rx path, ENABLE is low power rx path
  * @retval  None
  */
void USI_UARTLPRxpathSet(USI_TypeDef* USIx, u32 LPRxpath)
{
	/* To avoid gcc warnings */
	( void ) USIx;
	( void ) LPRxpath;
	/*AmebaZ's API, AmebaD doesn't use this API any more; this API is reserved for compatibility with AmebaZ*/
}

/**
  * @brief    Configure USI UART RX Clock.
  * @param  USIx: where x can be 0.
  * @param  RxClock:  This parameter can be one of the following values:
  * @retval   None
  * @note    USI V01(Ameba-D) not support this function. 
  */
void USI_UARTLPRxIPClockSet(USI_TypeDef* USIx, u32 RxIPClock)
{
	/* To avoid gcc warnings */
	( void ) RxIPClock;
	
	/* Check the parameters */
	assert_param(IS_ALL_USI_PERIPH(USIx));
	//assert_param(IS_USI_UART_RX_CLK(RxIPClock));

	/* not support */
}

/**
  * @brief    enable or disable Uart Low Power Rx Path
  * @param  USIx: where x can be 0.
  * @param  NewState: the new state of the Rx Path.
  *              This parameter can be: ENABLE or DISABLE.
  * @note    Because the TX/RX of the IrDA transceiver are in the same module, 
  *              RX fifo can also receive available data when in the process of TX.Therefore,
  *              the RX Path must be disabled when TX is going on.Namely, IrDA must work
  *              in the Half duplex mode, though normal UART IP supports Full duplex.
  * @retval None
  */				
void USI_UARTLPRxCmd(USI_TypeDef* USIx, u32 NewState)
{

