alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_hp/rtl8721dhp_usi_uart.c
	/*check the parameters*/
	assert_param(IS_ALL_USI_LP_PERIPH(USIx));

	if (NewState != DISABLE) {
		/*enable uart receiver*/
		USIx->SW_RESET |= USI_SW_RESET_RX_RSTB;
	} else {
		/*disable uart receiver*/
		USIx->SW_RESET &= (~USI_SW_RESET_RX_RSTB);
	}
}

/**
  * @brief    Fills each IrDA_InitStruct member with its default value.
  * @param  IrDA_InitStruct : pointer to a USI_UartIrDAInitTypeDef
  *              structure which will be initialized.
  * @retval   None
  */
void USI_UARTIrDAStructInit(USI_UartIrDAInitTypeDef * IrDA_InitStruct)
{
	/* Set the default value */
	IrDA_InitStruct->USI_UARTIrDARxInv = DISABLE;
	IrDA_InitStruct->USI_UARTIrDATxInv = DISABLE;
	IrDA_InitStruct->USI_UARTLowShift = USI_UART_IRDA_PULSE_LEFT_SHIFT;
	IrDA_InitStruct->USI_UARTLowShiftVal = 0;
	IrDA_InitStruct->USI_UARTUpperShift = USI_UART_IRDA_PULSE_LEFT_SHIFT;
	IrDA_InitStruct->USI_UARTUpperShiftVal = 0;
	IrDA_InitStruct->USI_UARTRxFilterCmd = ENABLE;
	IrDA_InitStruct->USI_UARTRxFilterThres = 7;
}

/**
  * @brief    Configures the USI UART's IrDA interface .
  * @param  USIx: where x can be 0.
  * @param  IrDA_InitStruct: pointer to a USI_UartIrDAInitTypeDef structure that contains
  *              the configuration information for the IrDA module.
  * @note    the details of IrDA_InitStruct members are:
  * @verbatim 
  *	           IrDA_InitStruct-> USI_UARTIrDARxInv:
  *				IrDA Rx invert bit:
  *                 		ENABLE: invert irda rx
  *                 		DISABLE: not invert irda rx
  *
  *	           IrDA_InitStruct->USI_UARTIrDATxInv:
  *				IrDA Tx invert bit:
  *                 		ENABLE: invert irda tx
  *                 		DISABLE: not invert irda tx
  *
  *	           IrDA_InitStruct->USI_UARTUpperShift:
  *			 	Upperbound(right edge) Shift direction:
  *			 		UART_IRDA_PULSE_LEFT_SHIFT: shift left
  *                 		UART_IRDA_PULSE_RIGHT_SHIFT: shift right
  *	           IrDA_InitStruct->UpperShiftVal:
  *				Upperbound Shift value
  *
  *	           IrDA_InitStruct->USI_UARTLowShift:
  *				Lowbound(left edge) Shift direction:
  *			 		UART_IRDA_PULSE_LEFT_SHIFT: shift left
  *                 		UART_IRDA_PULSE_RIGHT_SHIFT: shift right
  *	           IrDA_InitStruct->USI_UARTLowShiftVal:
  *				Lowbound Shift value
  *
  *	           IrDA_InitStruct->USI_UARTRxFilterThres:
  *				IrDA RX filter threshold
  *
  *	           IrDA_InitStruct->USI_UARTRxFilterCmd:
  *				IrDA RX filter enable or disable:
  *                 		ENABLE: enable IrDA rx filter
  *                 		DISABLE: disable IrDA rx filter
  * @endverbatim
  * @retval   None
  */
void USI_UARTIrDAInit(USI_TypeDef* USIx, USI_UartIrDAInitTypeDef * IrDA_InitStruct)
{
	u32 TempCtrl;
	u32 TempTxpulse;
	u32 TempRxPulse;

	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));
	assert_param(IrDA_InitStruct->USI_UARTUpperShiftVal <= 0x7fff );
	assert_param(IrDA_InitStruct->USI_UARTLowShiftVal <= 0x7fff);
	assert_param(IS_USI_IRDA_PUL_SHIFT(IrDA_InitStruct->USI_UARTLowShift));
	assert_param(IS_USI_IRDA_PUL_SHIFT(IrDA_InitStruct->USI_UARTUpperShift));							
	assert_param((IrDA_InitStruct->USI_UARTRxFilterThres <= 0x7fff));
	
	/*Get the UART_IRDA_CTRL register value*/
	TempCtrl = USIx->UART_IRDA_CTRL;
	
	/*configure the IrDA RX invert bit*/
	if(IrDA_InitStruct->USI_UARTIrDARxInv != DISABLE){
		/*invert the irda_rx_i*/
		TempCtrl |= USI_UART_IRDA_RX_INV;
	} else {
		/*not invert the irda_rx_i*/
		TempCtrl &= (~ USI_UART_IRDA_RX_INV);
	}

	/*configure the IrDA TX invert bit*/
	if(IrDA_InitStruct->USI_UARTIrDATxInv != DISABLE){
		/*invert the irda_tx_o*/
		TempCtrl |= USI_UART_IRDA_TX_INV;
	} else {
		/*not invert the irda_tx_o*/
		TempCtrl &= (~ USI_UART_IRDA_TX_INV);
	}
	USIx->UART_IRDA_CTRL = TempCtrl;

	/*Get the UART_IRDA_TX_PULSE_WD register value*/
	TempTxpulse = USIx->UART_IRDA_TX_PULSE_WD;
	
	/*configure IrDA SIR TX Pulse Width*/
	/*configure Upperbound(right edge) shift direction*/
	TempTxpulse &= (~ USI_UART_IRDA_TX_PUL_UP_BUND_SHIFT);
	TempTxpulse |= (IrDA_InitStruct->USI_UARTUpperShift << 31);

	/*configure the Upperbound shift value*/
	TempTxpulse &= (~ USI_UART_IRDA_TX_PUL_UP_BUND_VAL);
	TempTxpulse |= (IrDA_InitStruct->USI_UARTUpperShiftVal << 16);

	/*configure Lowbound(left edge) shift direction*/
	TempTxpulse &= (~ USI_UART_IRDA_TX_PUL_LOW_BUND_SHIFT);
	TempTxpulse |= (IrDA_InitStruct->USI_UARTLowShift << 15);

	/*configure the Lowbound shift value*/
	TempTxpulse &= (~ USI_UART_IRDA_TX_PUL_LOW_BUND_VAL);
	TempTxpulse |= (IrDA_InitStruct->USI_UARTLowShiftVal);	

	USIx->UART_IRDA_TX_PULSE_WD = TempTxpulse;

	/*Get the RXPLSR register value*/
	TempRxPulse = USIx->UART_IRDA_RX_PULSE_WD;

	/*configure IrDA RX filter threshold*/
	TempRxPulse &= (~ USI_UART_IRDA_RX_FILTER_THRES);
	TempRxPulse |= (IrDA_InitStruct->USI_UARTRxFilterThres << 1);
	
	if(IrDA_InitStruct->USI_UARTRxFilterCmd != DISABLE){
		/*enable IrDA rx filter*/
		TempRxPulse |= USI_UART_IRDA_RX_FILTER_ENABLE;
	} else {
		/*disable IrDA rx filter*/
		TempRxPulse &= (~ USI_UART_IRDA_RX_FILTER_ENABLE);
	}

	USIx->UART_IRDA_RX_PULSE_WD = TempRxPulse;
}

/**
  * @brief    enable or disable the IrDA function.
  * @param  USIx: where x can be 0.
  * @param  NewState: the new state of the IrDA.
  *              This parameter can be: ENABLE or DISABLE.
  * @retval   None
  */
void USI_UARTIrDACmd(USI_TypeDef* USIx, u32 NewState)
{
	/*check the parameters*/
	assert_param(IS_ALL_USI_PERIPH(USIx));

	if(NewState != DISABLE ){
		/* enable the IrDA */
		USIx->UART_IRDA_CTRL|= USI_UART_IRDA_ENABLE;
	} else {
		/* disable the IrDA */
		USIx->UART_IRDA_CTRL &= (~ USI_UART_IRDA_ENABLE);
	}
}
/******************* (C) COPYRIGHT 2017 Realtek Semiconductor *****END OF FILE****/
